Public Attributes | List of all members
API_OpenLibPartInfo Struct Reference
Library Part Management
The information of a library part required for opening the library part with ACAPI_LibraryManagement_OpenLibraryPart. More...
#include <APIdefs_Automate.h>
 Public Attributes
 IO::Location *  | libPartLoc
Full path of the library part to open.
 const GS::uchar_t *  | docName
Document/symbol name (Unicode format) of the library part to open.
 bool  | debugGDL
GDL File indicator.
 char  | filler [3]
Detailed Description
The information of a library part required for opening the library part with ACAPI_LibraryManagement_OpenLibraryPart.